
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.pre_api[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pre_api[0].azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api;rev=67" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "pre-api"
      ~ revision              = "67" -> "68" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (12 unchanged attributes hidden)

      ~ subscription_key_parameter_names {
          + api_management_name   = (known after apply)
          + api_type              = (known after apply)
          + description           = (known after apply)
          + display_name          = (known after apply)
          + id                    = (known after apply)
          + is_current            = (known after apply)
          + is_online             = (known after apply)
          + name                  = (known after apply)
          + path                  = (known after apply)
          + protocols             = (known after apply)
          + resource_group_name   = (known after apply)
          + revision              = (known after apply)
          + revision_description  = (known after apply)
          + service_url           = (known after apply)
          + soap_pass_through     = (known after apply)
          + source_api_id         = (known after apply)
          + subscription_required = (known after apply)
          + terms_of_service_url  = (known after apply)
          + version               = (known after apply)
          + version_description   = (known after apply)
          + version_set_id        = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":588,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->